kylefoxaustin/mcxn947qemu/hw/dma/mcxn_edma.c
/*
 * NXP MCX N eDMA (enhanced DMA) — functional model.  See header.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/dma/mcxn_edma.h"
#include "hw/core/irq.h"
#include "migration/vmstate.h"
#include "qemu/main-loop.h"
#include "system/address-spaces.h"
#include "system/dma.h"
#include "qemu/bswap.h"

/* Management-page registers. */
#define R_MP_CSR  0x00
#define R_MP_ES   0x04
#define R_MP_INT  0x08
#define R_MP_HRS  0x0C
#define R_CH_GRPRI 0x100   /* [16] */

/* Per-channel register offsets (within the channel's 0x1000 block). */
#define R_CH_CSR   0x00
#define R_CH_ES    0x04
#define R_CH_INT   0x08
#define R_CH_SBR   0x0C
#define R_CH_PRI   0x10
#define R_CH_MUX   0x14
#define R_TCD_SADDR 0x20
#define R_TCD_SOFF  0x24
#define R_TCD_ATTR  0x26
#define R_TCD_NBYTES 0x28
#define R_TCD_SLAST 0x2C
#define R_TCD_DADDR 0x30
#define R_TCD_DOFF  0x34
#define R_TCD_CITER 0x36
#define R_TCD_DLAST 0x38
#define R_TCD_CSR   0x3C
#define R_TCD_BITER 0x3E

/* CH_ES — error status (CMSIS DMA_CH_ES_*).  The eDMA VALIDATES THE TCD BEFORE
 * IT MOVES ANYTHING and refuses to run on an error; it does not quietly move a
 * partial minor loop. */
#define CH_ES_SGE    (1u << 2)    /* scatter/gather configuration error */
#define CH_ES_NCE    (1u << 3)    /* NBYTES/CITER configuration error */
#define CH_ES_DOE    (1u << 4)    /* destination offset error         */
#define CH_ES_DAE    (1u << 5)    /* destination address error        */
#define CH_ES_SOE    (1u << 6)    /* source offset error              */
#define CH_ES_SAE    (1u << 7)    /* source address error             */
#define CH_ES_ERR    (1u << 31)   /* any of the above                 */

#define CH_CSR_ERQ   (1u << 0)
#define CH_CSR_EEI   (1u << 2)   /* error interrupt enable (CMSIS DMA_CH_CSR_EEI) */
#define CH_CSR_DONE  (1u << 30)
#define CH_INT_INT   (1u << 0)
#define TCD_CSR_START    (1u << 0)
#define TCD_CSR_INTMAJOR (1u << 1)
#define TCD_CSR_DREQ     (1u << 3)   /* CMSIS DMA_TCD_CSR_DREQ_MASK */
#define TCD_CSR_ESG      (1u << 4)   /* enable scatter/gather: load the next TCD */
#define TCD_CSR_MAJORELINK (1u << 5) /* link a channel on major completion       */
#define TCD_CSR_MAJORLINKCH(v)  (((v) >> 8) & 0xF)

/* ATTR: SMOD[15:11] / SSIZE[10:8] / DMOD[7:3] / DSIZE[2:0]  (CMSIS DMA_TCD_ATTR_*)
 * SMOD/DMOD define a CIRCULAR BUFFER: the address wraps inside a 2^MOD-aligned
 * block.  These were NOT MODELLED, so the stock wrap_transfer example ran off the
 * end of its source buffer and handed the guest ADJACENT MEMORY -- 150000000,
 * 16000000, 32768: the clock constants that happened to live next door.  Not
 * zeros.  PLAUSIBLE NUMBERS.  A silent wrong answer with real data in it. */
#define ATTR_SMOD(a)   (((a) >> 11) & 0x1F)
#define ATTR_DMOD(a)   (((a) >> 3) & 0x1F)

/* CITER/BITER: when ELINK is set the count is only 9 bits -- the upper bits are
 * the link channel.  Masking with 0x7FFF would read LINKCH AS PART OF THE COUNT. */
#define CITER_ELINK      (1u << 15)
#define CITER_ELINK_MASK 0x1FFu
#define CITER_LINKCH(v)  (((v) >> 9) & 0xF)
#define ATTR_SSIZE(a)  (((a) >> 8) & 0x7)
#define ATTR_DSIZE(a)  ((a) & 0x7)
#define NBYTES_MASK  0x3FFFFFFFu
#define CITER_MASK   0x7FFFu

/*
 * Advance an address by its offset, honouring the ATTR modulo (circular buffer).
 * A zero MOD means a plain linear advance.  With MOD = k the address wraps inside
 * its own 2^k-aligned block, which is exactly what makes a ring buffer a ring.
 */
static uint32_t edma_advance(uint32_t addr, int16_t off, unsigned mod)
{
    uint32_t mask;

    if (mod == 0) {
        return addr + off;
    }
    mask = (1u << mod) - 1;
    return (addr & ~mask) | ((addr + off) & mask);
}

/* Forward decl: a linked channel is started by setting its TCD_CSR[START]. */
static void edma_run(MCXNEDMAState *s, int n);

/*
 * CHANNEL LINKING.  On minor- or major-loop completion a channel can start
 * ANOTHER channel.  This was not modelled at all, so the stock `channel_link`
 * example moved NOTHING -- both destination buffers came back all zeros.
 */
static void edma_link_channel(MCXNEDMAState *s, unsigned link)
{
    if (link >= MCXN_EDMA_CHANNELS || s->in_link) {
        return;                           /* bound the chain: no link loops */
    }
    s->in_link = true;
    s->ch[link].csr &= ~CH_CSR_DONE;
    edma_run(s, link);
    s->in_link = false;
}

/*
 * SCATTER/GATHER.  With TCD_CSR[ESG], TCD_DLAST_SGA is not a signed adjustment --
 * IT IS A POINTER TO THE NEXT TCD, which the engine loads on major completion and
 * then runs.  Not modelled, so the stock `scatter_gather` and `ping_pong`
 * examples ran only their FIRST TCD: destination came back "1 2 3 4 0 0 0 0",
 * half the transfer silently missing.
 *
 * The in-memory TCD is 32 bytes, laid out exactly as the channel's TCD registers.
 */
static bool edma_load_next_tcd(MCXNEDMAState *s, int n)
{
    MCXNEDMAChan *c = &s->ch[n];
    hwaddr sga = c->tcd_dlast;            /* DLAST_SGA doubles as the pointer */
    uint8_t tcd[32];

    if (sga == 0 || (sga & 0x1F)) {
        c->es |= CH_ES_SGE | CH_ES_ERR;   /* scatter/gather config error */
        return false;
    }
    if (dma_memory_read(&address_space_memory, sga, tcd, sizeof(tcd),
                        MEMTXATTRS_UNSPECIFIED) != MEMTX_OK) {
        c->es |= CH_ES_SGE | CH_ES_ERR;
        return false;
    }

    c->tcd_saddr  = ldl_le_p(tcd + 0x00);
    c->tcd_soff   = lduw_le_p(tcd + 0x04);
    c->tcd_attr   = lduw_le_p(tcd + 0x06);
    c->tcd_nbytes = ldl_le_p(tcd + 0x08);
    c->tcd_slast  = ldl_le_p(tcd + 0x0C);
    c->tcd_daddr  = ldl_le_p(tcd + 0x10);
    c->tcd_doff   = lduw_le_p(tcd + 0x14);
    c->tcd_citer  = lduw_le_p(tcd + 0x16);
    c->tcd_dlast  = ldl_le_p(tcd + 0x18);
    c->tcd_csr    = lduw_le_p(tcd + 0x1C);
    c->tcd_biter  = lduw_le_p(tcd + 0x1E);
    return true;
}

static void edma_update_irq(MCXNEDMAState *s, int n)
{
    qemu_set_irq(s->irq[n], !!(s->ch[n].intr & CH_INT_INT));
}

