kylefoxaustin/mcxn947qemu/hw/dma/mcxn_edma.c
/*
 * Run ONE MINOR LOOP (NBYTES) of a channel and advance the TCD.  Returns true
 * once the MAJOR loop completes.
 *
 * This is the unit a HARDWARE REQUEST moves.  Real eDMA does not transfer a
 * whole buffer when a peripheral asks for service: a SAI whose FIFO dropped
 * below its watermark asks for ONE minor loop, the DMA moves NBYTES into the
 * FIFO, and the peripheral asks again when it next needs data.  That is the
 * whole shape of DMA-driven audio/ADC/UART, and modelling only the
 * software-START path (which ran the entire major loop in one go) meant this
 * device could not do it at all.
 */
static bool edma_minor_loop(MCXNEDMAState *s, int n)
{
    MCXNEDMAChan *c = &s->ch[n];
    uint32_t ssize = 1u << ATTR_SSIZE(c->tcd_attr);
    uint32_t dsize = 1u << ATTR_DSIZE(c->tcd_attr);
    uint32_t nbytes = c->tcd_nbytes & NBYTES_MASK;
    unsigned smod = ATTR_SMOD(c->tcd_attr);
    unsigned dmod = ATTR_DMOD(c->tcd_attr);
    bool elink = (c->tcd_citer & CITER_ELINK) != 0;
    uint32_t cmask = elink ? CITER_ELINK_MASK : CITER_MASK;
    uint32_t citer = c->tcd_citer & cmask;
    int16_t soff = (int16_t)c->tcd_soff;
    int16_t doff = (int16_t)c->tcd_doff;
    uint32_t saddr = c->tcd_saddr, daddr = c->tcd_daddr;
    uint8_t buf[MCXN_EDMA_MAX_XFER];
    uint32_t chunk;
    uint32_t err;
    uint32_t b;

    if (dsize == 0 || nbytes == 0 || citer == 0) {
        /* CITER=0 / NBYTES=0 is a CONFIGURATION ERROR, not a completed transfer.
         * Setting DONE here told the guest an empty TCD had "finished". */
        c->es |= CH_ES_NCE | CH_ES_ERR;
        if (c->csr & CH_CSR_EEI) {
            c->intr |= CH_INT_INT;
            edma_update_irq(s, n);
        }
        return true;
    }

    /*
     * ⚠ CONFIGURATION CHECK — and this used to be a SILENT DATA LOSS.
     *
     * The minor loop below is `for (b = 0; b + step <= nbytes; b += step)`.  With
     * NBYTES=6 and a 4-byte transfer size it moved FOUR BYTES AND DROPPED TWO --
     * no error, no flag, DONE set, INTMAJOR raised, and the guest told that its
     * transfer had completed.  Real eDMA does not do that: a NBYTES that is not a
     * multiple of the transfer size is a CONFIGURATION ERROR (CH_ES[NCE]) and the
     * channel REFUSES TO RUN.
     *
     * ⭐ EVERY TEST IN THIS TREE USED NBYTES = 4 WITH A 4-BYTE TRANSFER SIZE.
     * Perfectly round, and the bug is invisible at every round value.  Found by
     * carrying ollama_95_neutron's rule one column to the right:
     *   "ROUND NUMBERS ARE HOW BUGS SURVIVE -- a 2^n sweep sails straight past the
     *    broken values.  I learned the lesson ON the axis that taught it, and did
     *    not carry it ONE COLUMN TO THE RIGHT."
     */
    /*
     * ⚠ THE FULL TCD VALIDATION -- and I nearly shipped a DEAD ERROR CHANNEL while
     * fixing one.  When the NBYTES check went in I DEFINED CH_ES[SAE], [SOE],
     * [DAE] and [DOE] and IMPLEMENTED NONE OF THEM: four error bits that could
     * never be set, in a register a driver reads to find out what went wrong.
     * Exactly the "defined but never raised" class I had swept for hours earlier.
     *
     * ollama_95_neutron, on his N axis: "I am not predicting it is broken.  I am
     * saying I HAVE NO RIGHT TO SAY IT ISN'T."  My SOFF/SADDR axes had had the
     * same treatment -- every test uses SOFF=4 and an aligned buffer.  Round.
     *
     * Real eDMA validates the whole TCD before it moves anything (RM): a
     * misaligned address, an offset that is not a multiple of the transfer size,
     * a NBYTES that is not a multiple of it, or CITER=0, and the channel REFUSES
     * TO RUN.  Silently walking a misaligned buffer 3 bytes at a time produces
     * garbage that no firmware could diagnose.
     */
    err = 0;
    if (saddr % ssize) {
        err |= CH_ES_SAE;                 /* source address not aligned      */
    }
    if (soff % (int16_t)ssize) {
        err |= CH_ES_SOE;                 /* source offset not a multiple    */
    }
    if (daddr % dsize) {
        err |= CH_ES_DAE;                 /* dest address not aligned        */
    }
    if (doff % (int16_t)dsize) {
        err |= CH_ES_DOE;                 /* dest offset not a multiple      */
    }
    if (nbytes % ssize || nbytes % dsize) {
        err |= CH_ES_NCE;                 /* NBYTES not a multiple           */
    }
    if (ssize > MCXN_EDMA_MAX_XFER || dsize > MCXN_EDMA_MAX_XFER) {
        err |= CH_ES_NCE;                 /* burst wider than the engine     */
    }

    if (err) {
        c->es |= err | CH_ES_ERR;
        qemu_log_mask(LOG_GUEST_ERROR,
                      "mcxn-edma: ch%d TCD is invalid (CH_ES=0x%x): "
                      "SADDR=0x%x SOFF=%d DADDR=0x%x DOFF=%d NBYTES=%u "
                      "SSIZE=%u DSIZE=%u -- the channel does NOT run\n",
                      n, err, saddr, soff, daddr, doff, nbytes, ssize, dsize);
        /* The ERROR interrupt is gated by CH_CSR[EEI] -- NOT by TCD_CSR[INTMAJOR],
         * which is the TRANSFER-COMPLETE signal.  Raising major-completion on an
         * error would tell the guest "done" about a transfer that never ran,
         * which is the very lie this check exists to remove. */
        if (c->csr & CH_CSR_EEI) {
            c->intr |= CH_INT_INT;
            edma_update_irq(s, n);
        }
        return true;                      /* aborted: no DONE, no data moved */
    }

    /*
     * ⚠ SSIZE AND DSIZE ARE SEPARATE FIELDS, AND THIS USED TO IGNORE DSIZE
     * ENTIRELY.  The loop was `read(saddr, buf, step); write(daddr, buf, step);`
     * with step = SSIZE -- so the WRITE used the SOURCE width.  With SSIZE = 1 and
     * DSIZE = 4 the engine issued FOUR SEPARATE BYTE WRITES where the TCD asked
     * for ONE 32-BIT WRITE.
     *
     * To a MEMORY destination that is the same bytes and the bug is INVISIBLE.
     * To an MMIO PERIPHERAL REGISTER it is a completely different transaction:
     * four byte-pokes at a data register is not one word write -- a FIFO gets four
     * pushes instead of one, and a register with min_access_size = 4 rejects them
     * outright.  That is exactly the DMA-to-peripheral path this model now serves.
     *
     * ⭐ AND EVERY TEST IN THIS TREE SET SSIZE == DSIZE.  Each field was swept
     * ALONE and each was individually "correct"; the PAIR was never varied, so the
     * per-axis tests did not merely MISS this -- THEY CERTIFIED IT.
     * ollama_95_neutron, on exactly this shape: "An independent per-axis whitelist
     * will pass a shape that is garbage, with full confidence, because each axis is
     * individually safe.  That is the worst failure a gate can have.  It does not
     * merely MISS the bug -- IT CERTIFIES IT."
     *
     * Correct semantics: the minor loop moves NBYTES.  READS happen in SSIZE
     * chunks (SADDR advances by SOFF each), WRITES in DSIZE chunks (DADDR advances
     * by DOFF each) -- two independent strides.  Both sizes are powers of two, so
     * lcm(ssize, dsize) = max(ssize, dsize), and NBYTES is validated above to be a
     * multiple of both.
     */
    chunk = ssize > dsize ? ssize : dsize;

