kylefoxaustin/mcxn947qemu/hw/dma/mcxn_edma.c
    for (b = 0; b < nbytes; b += chunk) {
        uint32_t k;

        for (k = 0; k < chunk; k += ssize) {
            address_space_read(&address_space_memory, saddr,
                               MEMTXATTRS_UNSPECIFIED, buf + k, ssize);
            saddr = edma_advance(saddr, soff, smod);
        }
        for (k = 0; k < chunk; k += dsize) {
            address_space_write(&address_space_memory, daddr,
                                MEMTXATTRS_UNSPECIFIED, buf + k, dsize);
            daddr = edma_advance(daddr, doff, dmod);
        }
    }
    c->tcd_saddr = saddr;
    c->tcd_daddr = daddr;

    citer--;
    c->tcd_citer = (c->tcd_citer & ~cmask) | citer;

    /*
     * MINOR-loop channel link -- but NOT on the LAST minor loop.
     *
     * ⚠ Per the RM the minor link fires at the end of each minor loop EXCEPT the
     * final one; when CITER reaches 0 the MAJOR loop completes and MAJORELINK
     * fires INSTEAD.  Firing both meant the linked channel ran ONE TIME TOO MANY,
     * and on its extra pass its destination address had already been advanced --
     * so it wrote PAST THE END of its buffer and corrupted the next object in
     * memory.  In the stock channel_link example that object was the driver's own
     * `g_Transfer_Done` flag: the ISR set it true, the spurious extra transfer
     * stamped it back to false, and main waited forever on a flag that HAD been
     * set.  The interrupt fired, the ISR ran, the CPU took exception 19 and
     * returned cleanly -- and the machine still hung, because the DMA was
     * overwriting the very variable the guest was polling.
     */
    if (citer != 0) {
        if (elink) {
            edma_link_channel(s, CITER_LINKCH(c->tcd_citer));
        }
        return false;                     /* major loop still running */
    }

    /* Major loop complete. */
    c->tcd_saddr = saddr + (int32_t)c->tcd_slast;
    if (!(c->tcd_csr & TCD_CSR_ESG)) {
        /* Without scatter/gather DLAST is a signed adjustment.  WITH it, DLAST_SGA
         * is a POINTER to the next TCD and must NOT be added to DADDR. */
        c->tcd_daddr = daddr + (int32_t)c->tcd_dlast;
    } else {
        c->tcd_daddr = daddr;
    }
    c->tcd_citer = c->tcd_biter;          /* reload major count */

    /* MAJOR-loop channel link. */
    if (c->tcd_csr & TCD_CSR_MAJORELINK) {
        edma_link_channel(s, TCD_CSR_MAJORLINKCH(c->tcd_csr));
    }

    /*
     * SCATTER/GATHER: load the next TCD.
     *
     * ⚠ AND THE CHAIN MUST YIELD TO THE GUEST BETWEEN TCDs.  A ping-pong chain is
     * CIRCULAR BY DESIGN (TCD A -> B -> A forever, a continuous double-buffer);
     * the driver's INTMAJOR handler counts iterations and stops it.  Running the
     * chain synchronously never lets that ISR execute, so the machine SPINS -- my
     * first version hung the stock ping_pong example outright, having "fixed"
     * scatter_gather (whose last TCD has ESG=0 and therefore terminates).
     *
     * So: load the next TCD, raise the major interrupt, and RE-ARM through the
     * bottom half.  The guest gets to run its ISR between links, exactly as it
     * does on silicon.
     */
    if (c->tcd_csr & TCD_CSR_ESG) {
        /*
         * ⚠ LOAD THE NEXT TCD -- BUT DO NOT RUN IT.
         *
         * Real eDMA loads the next TCD on major completion and then STOPS; the
         * channel must be re-triggered (by a request or a fresh START) to run it.
         * My first version RE-ARMED the channel itself, which chained the whole
         * list synchronously.  That "fixed" nothing (scatter_gather already worked
         * once the modulo and the ELINK-aware CITER were right) and it HUNG the
         * stock ping_pong example outright: a ping-pong chain is CIRCULAR by
         * design, and the NXP driver walks it from its own INTMAJOR handler.  My
         * hardware chaining double-processed a list the driver was already
         * managing, and the machine spun.
         *
         * Found by mutation: DISABLING scatter-gather entirely left the test GREEN
         * and made ping_pong PASS.  A feature I added, that was not needed, that
         * broke a working case -- and only breaking it on purpose showed me.
         */
        (void)edma_load_next_tcd(s, n);   /* SGE flagged inside on a bad pointer */
    }

    c->csr |= CH_CSR_DONE;
    if (c->tcd_csr & TCD_CSR_DREQ) {
        c->csr &= ~CH_CSR_ERQ;            /* auto-disable the request */
    }
    if (c->tcd_csr & TCD_CSR_INTMAJOR) {
        c->intr |= CH_INT_INT;
        edma_update_irq(s, n);
    }
    return true;
}

/*
 * A SERVICE REQUEST: run ONE MINOR LOOP.
 *
 * ⚠ THIS USED TO RUN THE ENTIRE MAJOR LOOP, AND THAT IS A CORE SEMANTICS BUG.
 * TCD_CSR[START] is a software-initiated SERVICE REQUEST -- exactly like a
 * peripheral DMA request -- and one request moves ONE MINOR LOOP (NBYTES), not
 * the whole major loop.  The engine then clears START.
 *
 * The stock channel_link example proves it: it calls EDMA_TriggerChannelStart
 * TWICE, because its channel has CITER = 2.  Two minor loops, two service
 * requests.  My model completed the WHOLE transfer on the first trigger, so the
 * second trigger RAN EVERYTHING AGAIN -- and by then the linked channels' SADDR
 * and DADDR had already advanced past their buffers:
 *
 *     1st trigger:  ch1 saddr=0x20000064 daddr=0x2000014c   correct
 *     2nd trigger:  ch1 saddr=0x20000074 daddr=0x2000015c   walked into destAddr2
 *                   ch2 saddr=0x20000074 daddr=0x2000016c   past the end entirely
 *
 * It wrote past the buffers, corrupted the guest's memory, and the CPU took a
 * HARD FAULT (CFSR = INVSTATE, HFSR = FORCED).  The "hang" I had been chasing was
 * never a hang: THE GUEST HAD CRASHED, and HardFault_Handler is a while(1).  An
 * exit-1 crash and an exit-1 refusal, one more time.
 *
 * A channel LINK is also a service request, so it moves one minor loop too.
 */
static void edma_run(MCXNEDMAState *s, int n)
{
    edma_minor_loop(s, n);
    s->ch[n].tcd_csr &= ~TCD_CSR_START;   /* the engine clears START */
}

static uint64_t edma_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNEDMAState *s = MCXN_EDMA(opaque);
    MCXNEDMAChan *c;
    int n;

