kylefoxaustin/mcxn947qemu/hw/dma/mcxn_edma.c
    if (off < 0x1000) {
        switch (off) {
        case R_MP_CSR: return s->mp_csr;
        case R_MP_ES:  return s->mp_es;
        case R_MP_INT: {
            uint32_t r = 0;
            for (n = 0; n < MCXN_EDMA_CHANNELS; n++) {
                if (s->ch[n].intr & CH_INT_INT) {
                    r |= (1u << n);
                }
            }
            return r;
        }
        case R_MP_HRS: return 0;
        default:
            if (off >= R_CH_GRPRI && off < R_CH_GRPRI + 4 * MCXN_EDMA_CHANNELS) {
                return s->ch_grpri[(off - R_CH_GRPRI) / 4];
            }
            return 0;
        }
    }

    n = (off / 0x1000) - 1;
    if (n >= MCXN_EDMA_CHANNELS) {
        return 0;
    }
    c = &s->ch[n];
    switch (off % 0x1000) {
    case R_CH_CSR:    return c->csr;
    case R_CH_ES:     return c->es;
    case R_CH_INT:    return c->intr;
    case R_CH_SBR:    return c->sbr;
    case R_CH_PRI:    return c->pri;
    case R_CH_MUX:    return c->mux;
    case R_TCD_SADDR: return c->tcd_saddr;
    case R_TCD_SOFF:  return c->tcd_soff;
    case R_TCD_ATTR:  return c->tcd_attr;
    case R_TCD_NBYTES: return c->tcd_nbytes;
    case R_TCD_SLAST: return c->tcd_slast;
    case R_TCD_DADDR: return c->tcd_daddr;
    case R_TCD_DOFF:  return c->tcd_doff;
    case R_TCD_CITER: return c->tcd_citer;
    case R_TCD_DLAST: return c->tcd_dlast;
    case R_TCD_CSR:   return c->tcd_csr;
    case R_TCD_BITER: return c->tcd_biter;
    default:          return 0;
    }
}

static void edma_write(void *opaque, hwaddr off, uint64_t val, unsigned size)
{
    MCXNEDMAState *s = MCXN_EDMA(opaque);
    MCXNEDMAChan *c;
    uint32_t v = val;
    int n;

    if (off < 0x1000) {
        switch (off) {
        case R_MP_CSR: s->mp_csr = v; return;
        default:
            if (off >= R_CH_GRPRI && off < R_CH_GRPRI + 4 * MCXN_EDMA_CHANNELS) {
                s->ch_grpri[(off - R_CH_GRPRI) / 4] = v;
            }
            return;
        }
    }

    n = (off / 0x1000) - 1;
    if (n >= MCXN_EDMA_CHANNELS) {
        return;
    }
    c = &s->ch[n];
    switch (off % 0x1000) {
    case R_CH_CSR:
        /* DONE is write-1-to-clear; keep the rest. */
        if (v & CH_CSR_DONE) {
            c->csr &= ~CH_CSR_DONE;
        }
        c->csr = (c->csr & CH_CSR_DONE) | (v & ~CH_CSR_DONE);
        return;
    case R_CH_INT:
        if (v & CH_INT_INT) {                 /* write-1-to-clear */
            c->intr &= ~CH_INT_INT;
            edma_update_irq(s, n);
        }
        return;
    case R_CH_ES:
        c->es &= ~v;                      /* W1C */
        return;
    case R_CH_SBR:  c->sbr = v; return;
    case R_CH_PRI:  c->pri = v; return;
    case R_CH_MUX:  c->mux = v; return;
    case R_TCD_SADDR: c->tcd_saddr = v; return;
    case R_TCD_SOFF:  c->tcd_soff = v; return;
    case R_TCD_ATTR:  c->tcd_attr = v; return;
    case R_TCD_NBYTES: c->tcd_nbytes = v; return;
    case R_TCD_SLAST: c->tcd_slast = v; return;
    case R_TCD_DADDR: c->tcd_daddr = v; return;
    case R_TCD_DOFF:  c->tcd_doff = v; return;
    case R_TCD_CITER: c->tcd_citer = v; return;
    case R_TCD_DLAST: c->tcd_dlast = v; return;
    case R_TCD_CSR:
        c->tcd_csr = v;
        if (v & TCD_CSR_START) {
            c->csr &= ~CH_CSR_DONE;
            edma_run(s, n);
        }
        return;
    case R_TCD_BITER: c->tcd_biter = v; return;
    default: return;
    }
}

/*
 * Service every channel whose hardware request line is asserted.
 *
 * ⚠ THIS MUST RUN IN A BOTTOM HALF, NOT INLINE FROM THE REQUEST.  A peripheral
 * raises its request from inside its OWN MMIO write handler (the SAI asserts
 * when firmware sets TCSR[FRDE]).  If the DMA then wrote straight back into that
 * peripheral, it would be a RE-ENTRANT MMIO access into a device already engaged
 * in I/O, and QEMU's re-entrancy guard DROPS IT:
 *
 *     qemu-system-arm: warning: Blocked re-entrant IO on MemoryRegion: mcxn-sai
 *                      at addr: 0x20
 *
 * The failure is SILENT DATA LOSS and it looks exactly like success: the channel
 * still walks its minor loops, still decrements CITER, still sets DONE and still
 * raises INTMAJOR -- while every byte it "moved" was thrown away and the FIFO
 * stayed empty.  A test that asked "did the transfer complete?" would pass.  Only
 * checking the DATA catches it.  Real DMA is asynchronous anyway; a bottom half
 * is both the correct model and the correct QEMU idiom.
 */
static void mcxn_edma_service_bh(void *opaque)
{
    MCXNEDMAState *s = opaque;
    int guard = 0;
    bool progress;

    do {
        int n;

        progress = false;

        for (n = 0; n < MCXN_EDMA_CHANNELS; n++) {
            MCXNEDMAChan *c = &s->ch[n];
            uint32_t src = c->mux & CH_MUX_SRC_MASK;

            if (!(c->csr & CH_CSR_ERQ) || src == 0) {
                continue;
            }
            if (!s->req_level[src]) {
                continue;               /* nothing is asking this channel */
            }
            if (!s->req_enabled[src]) {
                /* INPUTMUX_DMAn_REQ_ENABLE has this source's bit CLEAR: the
                 * request is blocked before it ever reaches the engine.  Silicon
                 * drops it here; so do we. */
                continue;
            }
            /*
             * One minor loop per request, as the hardware does.  Writing into
             * the peripheral makes it re-evaluate its FIFO and update its
             * request line (through mcxn_edma_req below), so the next pass of
             * this loop sees the new level.
             */
            c->csr &= ~CH_CSR_DONE;
            edma_minor_loop(s, n);
            progress = true;
        }
    } while (progress && ++guard < MCXN_EDMA_MAX_LOOPS);
}

/*
 * A peripheral asserted (or dropped) its DMA request line.
 *
 * `src` is the MCX N request-mux source number from the CMSIS
 * dma_request_source_t enum (e.g. SAI0 Tx = 100, DAC0 = 25, ADC0 FIFO A = 21).
 * A channel consumes it when CH_MUX[SRC] selects that source and CH_CSR[ERQ]
 * enables the hardware request.  Until now ERQ was a DEAD CONSTANT -- defined,
 * never read -- and the only way to move a byte was a software TCD_CSR[START]
 * write.  That meant peripheral-triggered DMA, which is how essentially all real
 * audio/ADC/UART/SPI transfer works, DID NOT EXIST: a guest that set ERQ and
 * waited for the FIFO watermark to drive the transfer waited forever.
 *
 * We only latch the level here and kick the bottom half; see above for why the
 * transfer itself must not happen on this call stack.
 */
/*
 * INPUTMUX told us whether request source `src` is allowed through at all.
 * This is a GATE, not a request: it does not schedule anything by itself, but a
 * source that has just been re-enabled may already be asserting, so kick the
 * bottom half and let the service loop re-evaluate.
 */
static void mcxn_edma_req_enable(void *opaque, int src, int level)
{
    MCXNEDMAState *s = MCXN_EDMA(opaque);

    if (src < 0 || src >= MCXN_EDMA_REQ_SOURCES) {
        return;
    }
    if (s->req_enabled[src] == !!level) {
        return;
    }
    s->req_enabled[src] = level;
    if (level && s->req_level[src]) {
        qemu_bh_schedule(s->bh);
    }
}

