kylefoxaustin/mcxn947qemu/hw/dma/mcxn_edma.c
static void mcxn_edma_req(void *opaque, int src, int level)
{
    MCXNEDMAState *s = MCXN_EDMA(opaque);

    if (src < 0 || src >= MCXN_EDMA_REQ_SOURCES) {
        return;
    }
    s->req_level[src] = level;
    if (level) {
        qemu_bh_schedule(s->bh);
    }
}

static const MemoryRegionOps edma_ops = {
    .read = edma_read,
    .write = edma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

static void mcxn_edma_reset(DeviceState *dev)
{
    MCXNEDMAState *s = MCXN_EDMA(dev);

    s->mp_csr = 0;
    s->mp_es = 0;
    memset(s->ch_grpri, 0, sizeof(s->ch_grpri));
    memset(s->ch, 0, sizeof(s->ch));
    memset(s->req_level, 0, sizeof(s->req_level));
    /* INPUTMUX resets with every request line ENABLED (see the header). */
    memset(s->req_enabled, 1, sizeof(s->req_enabled));
}

static void mcxn_edma_realize(DeviceState *dev, Error **errp)
{
    MCXNEDMAState *s = MCXN_EDMA(dev);
    int n;

    /* One input per MCX N DMA request-mux source: peripherals drive these. */
    qdev_init_gpio_in(dev, mcxn_edma_req, MCXN_EDMA_REQ_SOURCES);
    qdev_init_gpio_in_named(dev, mcxn_edma_req_enable, "req-enable",
                            MCXN_EDMA_REQ_SOURCES);
    s->bh = qemu_bh_new(mcxn_edma_service_bh, s);

    /* Management page (0x0) + 16 channels x 0x1000 = 0x11000. */
    memory_region_init_io(&s->iomem, OBJECT(s), &edma_ops, s, TYPE_MCXN_EDMA,
                          0x1000 * (MCXN_EDMA_CHANNELS + 1));
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    for (n = 0; n < MCXN_EDMA_CHANNELS; n++) {
        sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq[n]);
    }
}

static const VMStateDescription vmstate_edma_chan = {
    .name = "mcxn-edma-chan",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(csr, MCXNEDMAChan),
        VMSTATE_UINT32(es, MCXNEDMAChan),
        VMSTATE_UINT32(intr, MCXNEDMAChan),
        VMSTATE_UINT32(sbr, MCXNEDMAChan),
        VMSTATE_UINT32(pri, MCXNEDMAChan),
        VMSTATE_UINT32(mux, MCXNEDMAChan),
        VMSTATE_UINT32(tcd_saddr, MCXNEDMAChan),
        VMSTATE_UINT32(tcd_slast, MCXNEDMAChan),
        VMSTATE_UINT32(tcd_daddr, MCXNEDMAChan),
        VMSTATE_UINT32(tcd_dlast, MCXNEDMAChan),
        VMSTATE_UINT32(tcd_nbytes, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_soff, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_attr, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_doff, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_citer, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_csr, MCXNEDMAChan),
        VMSTATE_UINT16(tcd_biter, MCXNEDMAChan),
        VMSTATE_END_OF_LIST()
    },
};

static const VMStateDescription vmstate_mcxn_edma = {
    .name = TYPE_MCXN_EDMA,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(mp_csr, MCXNEDMAState),
        VMSTATE_UINT32(mp_es, MCXNEDMAState),
        VMSTATE_UINT32_ARRAY(ch_grpri, MCXNEDMAState, MCXN_EDMA_CHANNELS),
        VMSTATE_STRUCT_ARRAY(ch, MCXNEDMAState, MCXN_EDMA_CHANNELS, 1,
                             vmstate_edma_chan, MCXNEDMAChan),
        VMSTATE_END_OF_LIST()
    },
};

static void mcxn_edma_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_edma_realize;
    device_class_set_legacy_reset(dc, mcxn_edma_reset);
    dc->vmsd = &vmstate_mcxn_edma;
}

static const TypeInfo mcxn_edma_types[] = {
    {
        .name          = TYPE_MCXN_EDMA,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNEDMAState),
        .class_init    = mcxn_edma_class_init,
    },
};

DEFINE_TYPES(mcxn_edma_types)
